"app.title" = "Mac Systeminfo";
"cpu.title" = "CPU";
"cpu.usage" = "Brug: %.1f%%";
"cpu.cores" = "Kernebrug";

"ram.title" = "Hukommelse";
"ram.usage" = "%.1f%% Brugt";

"disk.title" = "Disk";
"disk.usage" = "%.1f%% Brugt";

"network.title" = "Netværk";

"info.title" = "Generel Information";
"info.host" = "Computernavn";
"info.model" = "Model";
"info.os" = "Styresystem";
"info.processor" = "Processor";
"info.ramTotal" = "Samlet Hukommelse";
"info.diskTotal" = "Samlet Plads";
"info.localIP" = "Lokal IP";
"info.publicIP" = "Offentlig IP";
"info.temp" = "Temperaturstatus";

"button.settings" = "Indstillinger";
"button.quit" = "Afslut app";
"button.save" = "Gem ændringer";
"button.close" = "Luk";
"button.help" = "Brugervejledning";
"button.report" = "Opret rapport";
"button.contact" = "Kontakt os";
"button.showWindow" = "Vinduestilstand";
"report.title" = "Systemrapport";
"report.subtitle" = "Resumé af hardware- og softwaredetaljer";
"report.hardware" = "Hardwarespecifikationer";
"report.network" = "Netværksoplysninger";
"report.status" = "Aktuel status";
"report.copy" = "Kopier rapport";
"report.print" = "Udskriv";
"report.date" = "Rapportdato";

"settings.title" = "Indstillinger";
"settings.general" = "Generelt";
"settings.advanced" = "Avanceret";

"settings.view.title" = "Udseende";
"settings.view.showWindow" = "Vis som et vindue";
"settings.view.showCores" = "Vis Kernebrug";
"settings.view.showNetwork" = "Vis Netværkskort";
"settings.view.showDisk" = "Vis Diskkort";

"settings.monitor.title" = "Systemovervågning";
"settings.monitor.toggle" = "Stop / Start Overvågning";
"settings.monitor.energyMode" = "Strømsparetilstand";
"settings.monitor.refreshTime" = "Opdateringshastighed: %.1f s";
"settings.monitor.reset" = "Nulstil CPU & Netværkshistorik";

"settings.theme.title" = "Temavalg";
"settings.theme.label" = "Tema";
"settings.theme.auto" = "System";
"settings.theme.light" = "Lys";
"settings.theme.dark" = "Mørk";
"menu.startup.title" = "Opstart";
"menu.startup.enable" = "Start ved login";
"menu.startup.disable" = "Deaktiver start ved login";

"temp.normal" = "Normal 🌡";
"temp.warm" = "Varm";
"temp.hot" = "Meget varm 🔥";
"temp.critical" = "Kritisk 🚨";
"temp.unknown" = "Ukendt";
"ip.loading" = "Indlæser...";
"ip.notFound" = "Ikke fundet";
"unknown" = "Ukendt";

"settings.language.title" = "Sprog / Language";
"settings.language.system" = "Systemstandard";
"settings.language.restart" = "Genstart appen, for at sprogændringerne træder i kraft.";
"contact.social" = "Sociale Medier";

"help.title" = "Hjælp";
"help.subtitle" = "Sistem Bilgi – Funktioner og brugervejledning";
"help.version" = "Sistem Bilgi – Version 1.1  •  macOS 15+";
"help.developer" = "Udvikler: ModelPC";

"help.cpu.title" = "CPU-brug";
"help.cpu.desc" = "Viser realtids- og historisk processorforbrug. CPU-grafen sporer de seneste 30 målinger. Skifter til rødt over 80 % og blinker som advarsel. Aktivér per-kerne-brug via Indstillinger > Udseende > 'Vis Kernebrug'.";

"help.ram.title" = "Hukommelsesbrug (RAM)";
"help.ram.desc" = "Summen af aktive, inaktive og fastlåste sider beregnes som brugt hukommelse og vises som procent. Den blå statuslinje viser den aktuelle status.";

"help.disk.title" = "Diskbrug";
"help.disk.desc" = "Viser den samlede kapacitet og brugte plads på din hoveddisk (/) som procent. Skjul Disk-kortet via Indstillinger > Udseende > 'Vis Diskkort'.";

"help.network.title" = "Netværksbrug";
"help.network.desc" = "Viser den samlede download + upload-hastighed på tværs af alle netværksgrænseflader i KB/s. Grafen visualiserer de seneste 30 målinger på en dynamisk skala. Skjul via Indstillinger > Udseende > 'Vis Netværkskort'.";

"help.temp.title" = "Temperaturstatus";
"help.temp.desc" = "Systemets varmeniveau læses via macOS ThermalState API: Normal 🌡, Varm, Meget varm 🔥 og Kritisk 🚨. Nøjagtige gradsværdier stilles ikke til rådighed for tredjeparts-apps af Apple.";

"help.settings.title" = "Indstillinger og tilpasning";
"help.settings.desc" = "Åbn Indstillinger fra menubjælkeikonet. Brug fanen Udseende til at slå kort til/fra. Vælg Lys / Mørk / Auto-tema i fanen Avanceret. Juster opdateringshastigheden mellem 0,5 og 5 sekunder. Strømsparetilstand reducerer opdateringsfrekvensen, når appen er inaktiv.";

"help.menubar.title" = "Menubjælke og vinduetilstand";
"help.menubar.desc" = "Appen kører som standard i menubjælken. Aktiver det selvstændige vindue via Indstillinger > Udseende > 'Vis som et vindue'. Menubjælkeetiketten viser live CPU-procent og en minikraf.";

"contact.title" = "Kontakt";
"contact.subtitle" = "Kontakt udvikleren eller følg på sociale medier";
"contact.email.title" = "Send E-mail";
"contact.email.address" = "info@modelpc.com";
"contact.email.address2" = "Udvikler (modelpc91@gmail.gmail.com)";
"contact.social.youtube" = "YouTube";
"contact.social.github" = "GitHub";
"contact.social.x" = "X (Twitter)";
"contact.social.instagram" = "Instagram";
"contact.social.website" = "Hjemmeside";
